CSI API ETABS v1
cDetailing.GetOneDetailedSlab_OneDetailingOutput_StripInfo Method
 Represents the detailed rebars in one rebar strip of the slab, as defined in ETABS
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetOneDetailedSlab_OneDetailingOutput_StripInfo(
	int DetailingOutputIndex,
	int StripIndex,
	ref string Name,
	ref string LayerName,
	ref string StripType,
	ref int NumberRegions
)
Function GetOneDetailedSlab_OneDetailingOutput_StripInfo (
	DetailingOutputIndex As Integer,
	StripIndex As Integer,
	ByRef Name As String,
	ByRef LayerName As String,
	ByRef StripType As String,
	ByRef NumberRegions As Integer
) As Integer
Dim instance As cDetailing
Dim DetailingOutputIndex As Integer
Dim StripIndex As Integer
Dim Name As String
Dim LayerName As String
Dim StripType As String
Dim NumberRegions As Integer
Dim returnValue As Integer
returnValue = instance.GetOneDetailedSlab_OneDetailingOutput_StripInfo(DetailingOutputIndex,
	StripIndex, Name, LayerName, StripType,
	NumberRegions)
int GetOneDetailedSlab_OneDetailingOutput_StripInfo(
	int DetailingOutputIndex,
	int StripIndex,
	String^% Name,
	String^% LayerName,
	String^% StripType,
	int% NumberRegions
)
abstract GetOneDetailedSlab_OneDetailingOutput_StripInfo :
        DetailingOutputIndex : int *
        StripIndex : int *
        Name : string byref *
        LayerName : string byref *
        StripType : string byref *
        NumberRegions : int byref -> int
Parameters
DetailingOutputIndex
Type: System.Int32
 Detailing Output Index
StripIndex
Type: System.Int32
 Strip Index
Name
Type: System.String
 Strip Name, as defined in ETABS
LayerName
Type: System.String
 Layer Name, as defined in ETABS
StripType
Type: System.String
 Type of Design Strip, as defined in ETABS - Column, Middle, None
NumberRegions
Type: System.Int32
 Regions of Rebars in the Design Strip. Generated by CSiDetail based on strip geometry and slab geometry
Return Value
Type: Int32
Returns zero if the function is successful; otherwise it returns a nonzero value.
See Also
Reference
cDetailing Interface
ETABSv1 Namespace